# Configuración Básica equipos CISCO

## Nombres de los Dispositivos  

### Cambiar Nombre de Host:  

```plaintext  
Switch# configure terminal  
Switch(config)# hostname Nombre_Dispositivo  
```  

### Para Volver al Nombre Predeterminado:  

```plaintext  
Switch(config)# no hostname  
```  

### Importante:  
- El nombre debe empezar/terminar en letra o número.  
- No debe tener espacios, solo letras, números o guiones.  
- Máximo 63 caracteres.  

## Pautas de Contraseñas  
- Contraseñas largas (>8 caracteres), mezcla de mayúsculas, minúsculas, números y símbolos.  
- No usar contraseñas comunes o iguales en todos los dispositivos.  

## Configuración de Contraseñas  

### Proteger Acceso de Consola:  

```plaintext  
Switch# configure terminal  
Switch(config)# line console 0  
Switch(config-line)# password cisco  
Switch(config-line)# login  
Switch(config-line)# end  
```  

### Proteger Acceso Privilegiado (enable):  

```plaintext  
Switch# configure terminal  
Switch(config)# enable secret class  
Switch(config)# exit  
```  

### Proteger Acceso Remoto (VTY):  

```plaintext  
Switch# configure terminal  
Switch(config)# line vty 0 15  
Switch(config-line)# password cisco  
Switch(config-line)# login  
Switch(config-line)# end  
```  

## Ejersicios:

### Entrar al Modo de Configuración Global:

```plaintext
Switch# configure terminal
```
Permite cambiar configuraciones del dispositivo.

### Asignar Nombre al Switch:

```plaintext
Switch(config)# hostname Sw-Floor-1
```
Cambia el nombre por uno único y descriptivo.

### Proteger el Acceso por Consola (Modo EXEC de Usuario):

```plaintext
Sw-Floor-1(config)# line console 0
Sw-Floor-1(config-line)# password cisco
Sw-Floor-1(config-line)# login
Sw-Floor-1(config-line)# exit
```
Pide contraseña al conectar físicamente vía consola.

### Proteger el Modo EXEC Privilegiado (Administrador):

```plaintext
Sw-Floor-1(config)# enable secret class
```
Establece una contraseña encriptada para acceder a todos los comandos del switch.

### Proteger el Acceso Remoto (Líneas VTY 0-15, para Telnet/SSH):

```plaintext
Sw-Floor-1(config)# line vty 0 15
Sw-Floor-1(config-line)# password cisco
Sw-Floor-1(config-line)# login
Sw-Floor-1(config-line)# exit
```
Requiere contraseña para conexiones remotas.

### Encriptar Todas las Contraseñas Visibles en Texto Claro:

```plaintext
Sw-Floor-1(config)# service password-encryption
```
Protege las contraseñas aplicando una encriptación básica.

### Crear un Mensaje de Advertencia (Banner):

```plaintext
Sw-Floor-1(config)# banner motd #Warning! Authorized access only!#
```
Muestra un mensaje legal antes de permitir el acceso al dispositivo.


## Configuración de Interfaz Virtual de Switch

Para acceder al switch de manera remota, se deben configurar una dirección IP y una máscara de subred en la SVI. La SVI (Switch Virtual Interface) no es una interfaz física real, sino una virtual. A continuación, se describen los pasos para configurar una SVI en un switch:

1. **Entrar al Modo de Configuración Global:**
    ```plaintext
    Sw-Floor-1# configure terminal
    ```

2. **Configurar la Interfaz VLAN 1:**
    ```plaintext
    Sw-Floor-1(config)# interface vlan 1
    ```

3. **Asignar Dirección IPv4 y Máscara de Subred:**
    ```plaintext
    Sw-Floor-1(config-if)# ip address 192.168.1.20 255.255.255.0
    ```

4. **Habilitar la Interfaz Virtual:**
    ```plaintext
    Sw-Floor-1(config-if)# no shutdown
    ```

5. **Salir de la Configuración de la Interfaz:**
    ```plaintext
    Sw-Floor-1(config-if)# exit
    ```

6. **Configurar la Puerta de Enlace Predeterminada:**
    ```plaintext
    Sw-Floor-1(config)# ip default-gateway 192.168.1.1
    ```

### Verificador de Sintaxis - Configuración de una Interfaz Virtual de Switch

1. **Entrar al Modo de Configuración de la Interfaz VLAN 1:**
    ```plaintext
    Switch(config)# interface vlan 1
    ```

2. **Configurar la Dirección IPv4 y Máscara de Subred:**
    ```plaintext
    Switch(config-if)# ip address 192.168.1.20 255.255.255.0
    ```

3. **Habilitar la Interfaz:**
    ```plaintext
    Switch(config-if)# no shutdown
    ```

    **Mensaje del Sistema:**
    ```plaintext
    %LINK-5-CHANGED: Interface Vlan1, changed state to up
    ```

### Resultado

Con estos pasos, se ha configurado correctamente la interfaz virtual del switch para la VLAN 1, permitiendo la comunicación IPv4 a través de la red.

